case3/TemplateCase-0.05/system/blockMeshDict
// Parametrized windTunnel

//Run using:
//m4 -P blockMeshDict.m4 > blockMeshDict

//m4 definitions:

//Mathematical constants:


//m4 spec:


//plane A settlingChamberInlet


//plane B contractionInlet


//plane C testSectionInlet


//plane D diffuserInlet


//plane E fanInlet


//plane F fanOutlet


//plane z:


//spline:


/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices        
(
	// front side
	(-0.5 -0.25 0) // Vertex A0 = 0 
	(0.5 -0.25 0) // Vertex B0 = 1 
	(0.5 0.25 0) // Vertex B1 = 2 
	(-0.5 0.25 0) // Vertex A1 = 3 

	// back side	
	(-0.5 -0.25 0.01) // Vertex A3 = 4 
	(0.5 -0.25 0.01) // Vertex B3 = 5 
	(0.5 0.25 0.01) // Vertex B2 = 6 
	(-0.5 0.25 0.01) // Vertex A2 = 7 

);

blocks          
(
    // stenosis domain	
    hex (0 1 2 3 4 5 6 7) (50 50 1) simpleGrading (1 1 1)
);

edges           
(
spline 0 3
(
(-5.030780453066971969e-01 -2.401960784313725561e-01 0.000000000000000000e+00)
(-5.061444145332356648e-01 -2.303921568627451122e-01 0.000000000000000000e+00)
(-5.091874758908285781e-01 -2.205882352941176405e-01 0.000000000000000000e+00)
(-5.121956860054188709e-01 -2.107843137254901966e-01 0.000000000000000000e+00)
(-5.151576337056521515e-01 -2.009803921568627527e-01 0.000000000000000000e+00)
(-5.180620833093576572e-01 -1.911764705882352811e-01 0.000000000000000000e+00)
(-5.208980172443391510e-01 -1.813725490196078372e-01 0.000000000000000000e+00)
(-5.236546778418005310e-01 -1.715686274509803932e-01 0.000000000000000000e+00)
(-5.263216081438677474e-01 -1.617647058823529493e-01 0.000000000000000000e+00)
(-5.288886915704125169e-01 -1.519607843137255054e-01 0.000000000000000000e+00)
(-5.313461902947053117e-01 -1.421568627450980338e-01 0.000000000000000000e+00)
(-5.336847821823278437e-01 -1.323529411764705899e-01 0.000000000000000000e+00)
(-5.358955961532221313e-01 -1.225490196078431460e-01 0.000000000000000000e+00)
(-5.379702458327353387e-01 -1.127450980392156743e-01 0.000000000000000000e+00)
(-5.399008613640119414e-01 -1.029411764705882304e-01 0.000000000000000000e+00)
(-5.416801192610559701e-01 -9.313725490196078649e-02 0.000000000000000000e+00)
(-5.433012701892219187e-01 -8.333333333333334259e-02 0.000000000000000000e+00)
(-5.447581645677531670e-01 -7.352941176470589868e-02 0.000000000000000000e+00)
(-5.460452758972477172e-01 -6.372549019607842702e-02 0.000000000000000000e+00)
(-5.471577217235639168e-01 -5.392156862745098311e-02 0.000000000000000000e+00)
(-5.480912821586410022e-01 -4.411764705882353921e-02 0.000000000000000000e+00)
(-5.488424158879799952e-01 -3.431372549019606755e-02 0.000000000000000000e+00)
(-5.494082736040629689e-01 -2.450980392156862364e-02 0.000000000000000000e+00)
(-5.497867088147516679e-01 -1.470588235294117974e-02 0.000000000000000000e+00)
(-5.499762859856682784e-01 -4.901960784313735831e-03 0.000000000000000000e+00)
(-5.499762859856682784e-01 4.901960784313708075e-03 0.000000000000000000e+00)
(-5.497867088147516679e-01 1.470588235294117974e-02 0.000000000000000000e+00)
(-5.494082736040629689e-01 2.450980392156865140e-02 0.000000000000000000e+00)
(-5.488424158879799952e-01 3.431372549019606755e-02 0.000000000000000000e+00)
(-5.480912821586410022e-01 4.411764705882353921e-02 0.000000000000000000e+00)
(-5.471577217235639168e-01 5.392156862745095536e-02 0.000000000000000000e+00)
(-5.460452758972477172e-01 6.372549019607842702e-02 0.000000000000000000e+00)
(-5.447581645677531670e-01 7.352941176470589868e-02 0.000000000000000000e+00)
(-5.433012701892219187e-01 8.333333333333331483e-02 0.000000000000000000e+00)
(-5.416801192610559701e-01 9.313725490196078649e-02 0.000000000000000000e+00)
(-5.399008613640119414e-01 1.029411764705882026e-01 0.000000000000000000e+00)
(-5.379702458327353387e-01 1.127450980392156743e-01 0.000000000000000000e+00)
(-5.358955961532221313e-01 1.225490196078431460e-01 0.000000000000000000e+00)
(-5.336847821823278437e-01 1.323529411764705621e-01 0.000000000000000000e+00)
(-5.313461902947053117e-01 1.421568627450980338e-01 0.000000000000000000e+00)
(-5.288886915704125169e-01 1.519607843137255054e-01 0.000000000000000000e+00)
(-5.263216081438677474e-01 1.617647058823529216e-01 0.000000000000000000e+00)
(-5.236546778418005310e-01 1.715686274509803932e-01 0.000000000000000000e+00)
(-5.208980172443391510e-01 1.813725490196078649e-01 0.000000000000000000e+00)
(-5.180620833093576572e-01 1.911764705882352811e-01 0.000000000000000000e+00)
(-5.151576337056521515e-01 2.009803921568627527e-01 0.000000000000000000e+00)
(-5.121956860054188709e-01 2.107843137254901689e-01 0.000000000000000000e+00)
(-5.091874758908285781e-01 2.205882352941176405e-01 0.000000000000000000e+00)
(-5.061444145332356648e-01 2.303921568627451122e-01 0.000000000000000000e+00)
(-5.030780453066971969e-01 2.401960784313725283e-01 0.000000000000000000e+00)
)
spline 4 7
(
(-5.030780453066971969e-01 -2.401960784313725561e-01 1.000000000000000021e-02)
(-5.061444145332356648e-01 -2.303921568627451122e-01 1.000000000000000021e-02)
(-5.091874758908285781e-01 -2.205882352941176405e-01 1.000000000000000021e-02)
(-5.121956860054188709e-01 -2.107843137254901966e-01 1.000000000000000021e-02)
(-5.151576337056521515e-01 -2.009803921568627527e-01 1.000000000000000021e-02)
(-5.180620833093576572e-01 -1.911764705882352811e-01 1.000000000000000021e-02)
(-5.208980172443391510e-01 -1.813725490196078372e-01 1.000000000000000021e-02)
(-5.236546778418005310e-01 -1.715686274509803932e-01 1.000000000000000021e-02)
(-5.263216081438677474e-01 -1.617647058823529493e-01 1.000000000000000021e-02)
(-5.288886915704125169e-01 -1.519607843137255054e-01 1.000000000000000021e-02)
(-5.313461902947053117e-01 -1.421568627450980338e-01 1.000000000000000021e-02)
(-5.336847821823278437e-01 -1.323529411764705899e-01 1.000000000000000021e-02)
(-5.358955961532221313e-01 -1.225490196078431460e-01 1.000000000000000021e-02)
(-5.379702458327353387e-01 -1.127450980392156743e-01 1.000000000000000021e-02)
(-5.399008613640119414e-01 -1.029411764705882304e-01 1.000000000000000021e-02)
(-5.416801192610559701e-01 -9.313725490196078649e-02 1.000000000000000021e-02)
(-5.433012701892219187e-01 -8.333333333333334259e-02 1.000000000000000021e-02)
(-5.447581645677531670e-01 -7.352941176470589868e-02 1.000000000000000021e-02)
(-5.460452758972477172e-01 -6.372549019607842702e-02 1.000000000000000021e-02)
(-5.471577217235639168e-01 -5.392156862745098311e-02 1.000000000000000021e-02)
(-5.480912821586410022e-01 -4.411764705882353921e-02 1.000000000000000021e-02)
(-5.488424158879799952e-01 -3.431372549019606755e-02 1.000000000000000021e-02)
(-5.494082736040629689e-01 -2.450980392156862364e-02 1.000000000000000021e-02)
(-5.497867088147516679e-01 -1.470588235294117974e-02 1.000000000000000021e-02)
(-5.499762859856682784e-01 -4.901960784313735831e-03 1.000000000000000021e-02)
(-5.499762859856682784e-01 4.901960784313708075e-03 1.000000000000000021e-02)
(-5.497867088147516679e-01 1.470588235294117974e-02 1.000000000000000021e-02)
(-5.494082736040629689e-01 2.450980392156865140e-02 1.000000000000000021e-02)
(-5.488424158879799952e-01 3.431372549019606755e-02 1.000000000000000021e-02)
(-5.480912821586410022e-01 4.411764705882353921e-02 1.000000000000000021e-02)
(-5.471577217235639168e-01 5.392156862745095536e-02 1.000000000000000021e-02)
(-5.460452758972477172e-01 6.372549019607842702e-02 1.000000000000000021e-02)
(-5.447581645677531670e-01 7.352941176470589868e-02 1.000000000000000021e-02)
(-5.433012701892219187e-01 8.333333333333331483e-02 1.000000000000000021e-02)
(-5.416801192610559701e-01 9.313725490196078649e-02 1.000000000000000021e-02)
(-5.399008613640119414e-01 1.029411764705882026e-01 1.000000000000000021e-02)
(-5.379702458327353387e-01 1.127450980392156743e-01 1.000000000000000021e-02)
(-5.358955961532221313e-01 1.225490196078431460e-01 1.000000000000000021e-02)
(-5.336847821823278437e-01 1.323529411764705621e-01 1.000000000000000021e-02)
(-5.313461902947053117e-01 1.421568627450980338e-01 1.000000000000000021e-02)
(-5.288886915704125169e-01 1.519607843137255054e-01 1.000000000000000021e-02)
(-5.263216081438677474e-01 1.617647058823529216e-01 1.000000000000000021e-02)
(-5.236546778418005310e-01 1.715686274509803932e-01 1.000000000000000021e-02)
(-5.208980172443391510e-01 1.813725490196078649e-01 1.000000000000000021e-02)
(-5.180620833093576572e-01 1.911764705882352811e-01 1.000000000000000021e-02)
(-5.151576337056521515e-01 2.009803921568627527e-01 1.000000000000000021e-02)
(-5.121956860054188709e-01 2.107843137254901689e-01 1.000000000000000021e-02)
(-5.091874758908285781e-01 2.205882352941176405e-01 1.000000000000000021e-02)
(-5.061444145332356648e-01 2.303921568627451122e-01 1.000000000000000021e-02)
(-5.030780453066971969e-01 2.401960784313725283e-01 1.000000000000000021e-02)
)
spline 1 2
(
(5.030780453066971969e-01 -2.401960784313725561e-01 0.000000000000000000e+00)
(5.061444145332356648e-01 -2.303921568627451122e-01 0.000000000000000000e+00)
(5.091874758908285781e-01 -2.205882352941176405e-01 0.000000000000000000e+00)
(5.121956860054188709e-01 -2.107843137254901966e-01 0.000000000000000000e+00)
(5.151576337056521515e-01 -2.009803921568627527e-01 0.000000000000000000e+00)
(5.180620833093576572e-01 -1.911764705882352811e-01 0.000000000000000000e+00)
(5.208980172443391510e-01 -1.813725490196078372e-01 0.000000000000000000e+00)
(5.236546778418005310e-01 -1.715686274509803932e-01 0.000000000000000000e+00)
(5.263216081438677474e-01 -1.617647058823529493e-01 0.000000000000000000e+00)
(5.288886915704125169e-01 -1.519607843137255054e-01 0.000000000000000000e+00)
(5.313461902947053117e-01 -1.421568627450980338e-01 0.000000000000000000e+00)
(5.336847821823278437e-01 -1.323529411764705899e-01 0.000000000000000000e+00)
(5.358955961532221313e-01 -1.225490196078431460e-01 0.000000000000000000e+00)
(5.379702458327353387e-01 -1.127450980392156743e-01 0.000000000000000000e+00)
(5.399008613640119414e-01 -1.029411764705882304e-01 0.000000000000000000e+00)
(5.416801192610559701e-01 -9.313725490196078649e-02 0.000000000000000000e+00)
(5.433012701892219187e-01 -8.333333333333334259e-02 0.000000000000000000e+00)
(5.447581645677531670e-01 -7.352941176470589868e-02 0.000000000000000000e+00)
(5.460452758972477172e-01 -6.372549019607842702e-02 0.000000000000000000e+00)
(5.471577217235639168e-01 -5.392156862745098311e-02 0.000000000000000000e+00)
(5.480912821586410022e-01 -4.411764705882353921e-02 0.000000000000000000e+00)
(5.488424158879799952e-01 -3.431372549019606755e-02 0.000000000000000000e+00)
(5.494082736040629689e-01 -2.450980392156862364e-02 0.000000000000000000e+00)
(5.497867088147516679e-01 -1.470588235294117974e-02 0.000000000000000000e+00)
(5.499762859856682784e-01 -4.901960784313735831e-03 0.000000000000000000e+00)
(5.499762859856682784e-01 4.901960784313708075e-03 0.000000000000000000e+00)
(5.497867088147516679e-01 1.470588235294117974e-02 0.000000000000000000e+00)
(5.494082736040629689e-01 2.450980392156865140e-02 0.000000000000000000e+00)
(5.488424158879799952e-01 3.431372549019606755e-02 0.000000000000000000e+00)
(5.480912821586410022e-01 4.411764705882353921e-02 0.000000000000000000e+00)
(5.471577217235639168e-01 5.392156862745095536e-02 0.000000000000000000e+00)
(5.460452758972477172e-01 6.372549019607842702e-02 0.000000000000000000e+00)
(5.447581645677531670e-01 7.352941176470589868e-02 0.000000000000000000e+00)
(5.433012701892219187e-01 8.333333333333331483e-02 0.000000000000000000e+00)
(5.416801192610559701e-01 9.313725490196078649e-02 0.000000000000000000e+00)
(5.399008613640119414e-01 1.029411764705882026e-01 0.000000000000000000e+00)
(5.379702458327353387e-01 1.127450980392156743e-01 0.000000000000000000e+00)
(5.358955961532221313e-01 1.225490196078431460e-01 0.000000000000000000e+00)
(5.336847821823278437e-01 1.323529411764705621e-01 0.000000000000000000e+00)
(5.313461902947053117e-01 1.421568627450980338e-01 0.000000000000000000e+00)
(5.288886915704125169e-01 1.519607843137255054e-01 0.000000000000000000e+00)
(5.263216081438677474e-01 1.617647058823529216e-01 0.000000000000000000e+00)
(5.236546778418005310e-01 1.715686274509803932e-01 0.000000000000000000e+00)
(5.208980172443391510e-01 1.813725490196078649e-01 0.000000000000000000e+00)
(5.180620833093576572e-01 1.911764705882352811e-01 0.000000000000000000e+00)
(5.151576337056521515e-01 2.009803921568627527e-01 0.000000000000000000e+00)
(5.121956860054188709e-01 2.107843137254901689e-01 0.000000000000000000e+00)
(5.091874758908285781e-01 2.205882352941176405e-01 0.000000000000000000e+00)
(5.061444145332356648e-01 2.303921568627451122e-01 0.000000000000000000e+00)
(5.030780453066971969e-01 2.401960784313725283e-01 0.000000000000000000e+00)
)
spline 5 6
(
(5.030780453066971969e-01 -2.401960784313725561e-01 1.000000000000000021e-02)
(5.061444145332356648e-01 -2.303921568627451122e-01 1.000000000000000021e-02)
(5.091874758908285781e-01 -2.205882352941176405e-01 1.000000000000000021e-02)
(5.121956860054188709e-01 -2.107843137254901966e-01 1.000000000000000021e-02)
(5.151576337056521515e-01 -2.009803921568627527e-01 1.000000000000000021e-02)
(5.180620833093576572e-01 -1.911764705882352811e-01 1.000000000000000021e-02)
(5.208980172443391510e-01 -1.813725490196078372e-01 1.000000000000000021e-02)
(5.236546778418005310e-01 -1.715686274509803932e-01 1.000000000000000021e-02)
(5.263216081438677474e-01 -1.617647058823529493e-01 1.000000000000000021e-02)
(5.288886915704125169e-01 -1.519607843137255054e-01 1.000000000000000021e-02)
(5.313461902947053117e-01 -1.421568627450980338e-01 1.000000000000000021e-02)
(5.336847821823278437e-01 -1.323529411764705899e-01 1.000000000000000021e-02)
(5.358955961532221313e-01 -1.225490196078431460e-01 1.000000000000000021e-02)
(5.379702458327353387e-01 -1.127450980392156743e-01 1.000000000000000021e-02)
(5.399008613640119414e-01 -1.029411764705882304e-01 1.000000000000000021e-02)
(5.416801192610559701e-01 -9.313725490196078649e-02 1.000000000000000021e-02)
(5.433012701892219187e-01 -8.333333333333334259e-02 1.000000000000000021e-02)
(5.447581645677531670e-01 -7.352941176470589868e-02 1.000000000000000021e-02)
(5.460452758972477172e-01 -6.372549019607842702e-02 1.000000000000000021e-02)
(5.471577217235639168e-01 -5.392156862745098311e-02 1.000000000000000021e-02)
(5.480912821586410022e-01 -4.411764705882353921e-02 1.000000000000000021e-02)
(5.488424158879799952e-01 -3.431372549019606755e-02 1.000000000000000021e-02)
(5.494082736040629689e-01 -2.450980392156862364e-02 1.000000000000000021e-02)
(5.497867088147516679e-01 -1.470588235294117974e-02 1.000000000000000021e-02)
(5.499762859856682784e-01 -4.901960784313735831e-03 1.000000000000000021e-02)
(5.499762859856682784e-01 4.901960784313708075e-03 1.000000000000000021e-02)
(5.497867088147516679e-01 1.470588235294117974e-02 1.000000000000000021e-02)
(5.494082736040629689e-01 2.450980392156865140e-02 1.000000000000000021e-02)
(5.488424158879799952e-01 3.431372549019606755e-02 1.000000000000000021e-02)
(5.480912821586410022e-01 4.411764705882353921e-02 1.000000000000000021e-02)
(5.471577217235639168e-01 5.392156862745095536e-02 1.000000000000000021e-02)
(5.460452758972477172e-01 6.372549019607842702e-02 1.000000000000000021e-02)
(5.447581645677531670e-01 7.352941176470589868e-02 1.000000000000000021e-02)
(5.433012701892219187e-01 8.333333333333331483e-02 1.000000000000000021e-02)
(5.416801192610559701e-01 9.313725490196078649e-02 1.000000000000000021e-02)
(5.399008613640119414e-01 1.029411764705882026e-01 1.000000000000000021e-02)
(5.379702458327353387e-01 1.127450980392156743e-01 1.000000000000000021e-02)
(5.358955961532221313e-01 1.225490196078431460e-01 1.000000000000000021e-02)
(5.336847821823278437e-01 1.323529411764705621e-01 1.000000000000000021e-02)
(5.313461902947053117e-01 1.421568627450980338e-01 1.000000000000000021e-02)
(5.288886915704125169e-01 1.519607843137255054e-01 1.000000000000000021e-02)
(5.263216081438677474e-01 1.617647058823529216e-01 1.000000000000000021e-02)
(5.236546778418005310e-01 1.715686274509803932e-01 1.000000000000000021e-02)
(5.208980172443391510e-01 1.813725490196078649e-01 1.000000000000000021e-02)
(5.180620833093576572e-01 1.911764705882352811e-01 1.000000000000000021e-02)
(5.151576337056521515e-01 2.009803921568627527e-01 1.000000000000000021e-02)
(5.121956860054188709e-01 2.107843137254901689e-01 1.000000000000000021e-02)
(5.091874758908285781e-01 2.205882352941176405e-01 1.000000000000000021e-02)
(5.061444145332356648e-01 2.303921568627451122e-01 1.000000000000000021e-02)
(5.030780453066971969e-01 2.401960784313725283e-01 1.000000000000000021e-02)
)
);




boundary
(
    left
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    right
    {
    	type patch;
    	faces
    	(
    		(2 6 5 1)
    	);
    }

    up
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }

    down
    {
        type patch;
        faces
        (
            //(0 4 7 3)
            //(2 6 5 1)
            (1 5 4 0)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);